In [1]:
import pandas as pd

df = pd.read_csv('./raw_sales.csv')
df.head()

              datesold  postcode   price propertyType  bedrooms
0  2007-02-07 00:00:00      2607  525000        house         4
1  2007-02-27 00:00:00      2906  290000        house         3
2  2007-03-07 00:00:00      2905  328000        house         3
3  2007-03-09 00:00:00      2905  380000        house         4
4  2007-03-21 00:00:00      2906  310000        house         3

In [2]:
new_columns = ['datesold', 'price']
df = df.drop([c for c in df.columns if c not in new_columns], axis=1)
df.head()

              datesold   price
0  2007-02-07 00:00:00  525000
1  2007-02-27 00:00:00  290000
2  2007-03-07 00:00:00  328000
3  2007-03-09 00:00:00  380000
4  2007-03-21 00:00:00  310000